
**Uploading input file for further cleaning**

In [237]:
import pandas as pd
df = pd.read_csv('input_file.csv',header = None)
df

                                              0
0         3 PM  Mon 24th-Mar-2014___0.384 kwh
1                5AM  15-Aug-2014___1.201  kwh
2          __8PM Thu 20-Mar-2014____1.523 kwh
3               6PM  23rd-Apr-2014___0.424  kwh
4     _1AM  Friday 19th-Dec-2014___0.209  kwh
...                                         ...
8755         _1AM  Fri 07th-Nov-2014_0.084 kwh
8756                _6AM 20-May-2014__1.027 kwh
8757   __2 AM  Tuesday 8th-Apr-2014___0.052 kwh
8758            9 PM 27th-Jan-2014_1.428  kwh
8759          _12 PM 25th-Aug-2014_0.528  kwh

[8760 rows x 1 columns]

Splitting column (separating time/date from kwh)

In [238]:
df[0] = df[0].str.replace("1_","1@")
df[0] = df[0].str.replace("2_","2@")
df[0] = df[0].str.replace("3_","3@")
df[0] = df[0].str.replace("4_","4@")
df[0] = df[0].str.replace("5_","5@")
df[0] = df[0].str.replace("6_","6@")
df[0] = df[0].str.replace("7_","7@")
df[0] = df[0].str.replace("8_","8@")
df[0] = df[0].str.replace("9_","9@")
df[[0,1]] = df[0].str.split('@',expand=True)
df

                                  0               1
0           3 PM  Mon 24th-Mar-2014   __0.384 kwh
1                  5AM  15-Aug-2014   __1.201  kwh
2             __8PM Thu 20-Mar-2014  ___1.523 kwh
3                6PM  23rd-Apr-2014    __0.424  kwh
4        _1AM  Friday 19th-Dec-2014  __0.209  kwh
...                             ...             ...
8755        _1AM  Fri 07th-Nov-2014      0.084 kwh
8756               _6AM 20-May-2014      _1.027 kwh
8757   __2 AM  Tuesday 8th-Apr-2014     __0.052 kwh
8758             9 PM 27th-Jan-2014    1.428  kwh
8759           _12 PM 25th-Aug-2014    0.528  kwh

[8760 rows x 2 columns]

Trimming and removing "_" in string

In [239]:
df[0] = df[0].str.replace("_","")
df[0] = df[0].str.strip()
df

                               0               1
0        3 PM  Mon 24th-Mar-2014   __0.384 kwh
1               5AM  15-Aug-2014   __1.201  kwh
2            8PM Thu 20-Mar-2014  ___1.523 kwh
3             6PM  23rd-Apr-2014    __0.424  kwh
4      1AM  Friday 19th-Dec-2014  __0.209  kwh
...                          ...             ...
8755      1AM  Fri 07th-Nov-2014      0.084 kwh
8756             6AM 20-May-2014      _1.027 kwh
8757  2 AM  Tuesday 8th-Apr-2014     __0.052 kwh
8758          9 PM 27th-Jan-2014    1.428  kwh
8759         12 PM 25th-Aug-2014    0.528  kwh

[8760 rows x 2 columns]

**Formatting time inside string**

In [240]:
df[0] = df[0].str.replace(" pm","pm")
df[0] = df[0].str.replace(" Pm","pm")
df[0] = df[0].str.replace(" PM","pm")
df[0] = df[0].str.replace("PM","pm")
df[0] = df[0].str.replace("Pm","pm")
df[0] = df[0].str.replace(" am","am")
df[0] = df[0].str.replace(" Am","am")
df[0] = df[0].str.replace(" AM","am")
df[0] = df[0].str.replace("AM","am")
df[0] = df[0].str.replace("Am","am")
df

                              0               1
0        3pm  Mon 24th-Mar-2014   __0.384 kwh
1              5am  15-Aug-2014   __1.201  kwh
2           8pm Thu 20-Mar-2014  ___1.523 kwh
3            6pm  23rd-Apr-2014    __0.424  kwh
4     1am  Friday 19th-Dec-2014  __0.209  kwh
...                         ...             ...
8755     1am  Fri 07th-Nov-2014      0.084 kwh
8756            6am 20-May-2014      _1.027 kwh
8757  2am  Tuesday 8th-Apr-2014     __0.052 kwh
8758          9pm 27th-Jan-2014    1.428  kwh
8759         12pm 25th-Aug-2014    0.528  kwh

[8760 rows x 2 columns]

**Formatting date**

In [241]:
df[0] = df[0].str.replace("st-","-")
df[0] = df[0].str.replace("nd-","-")
df[0] = df[0].str.replace("rd-","-")
df[0] = df[0].str.replace("th-","-")
df

                            0               1
0        3pm  Mon 24-Mar-2014   __0.384 kwh
1            5am  15-Aug-2014   __1.201  kwh
2         8pm Thu 20-Mar-2014  ___1.523 kwh
3            6pm  23-Apr-2014    __0.424  kwh
4     1am  Friday 19-Dec-2014  __0.209  kwh
...                       ...             ...
8755     1am  Fri 07-Nov-2014      0.084 kwh
8756          6am 20-May-2014      _1.027 kwh
8757  2am  Tuesday 8-Apr-2014     __0.052 kwh
8758          9pm 27-Jan-2014    1.428  kwh
8759         12pm 25-Aug-2014    0.528  kwh

[8760 rows x 2 columns]

**Separating time string from rest of the string**

In [242]:
df[0] = df[0].str.replace("m ","m *")
df[[0,2]] = df[0].str.split('*', expand = True)
df

          0               1                    2
0      3pm    __0.384 kwh        Mon 24-Mar-2014
1      5am    __1.201  kwh           15-Aug-2014
2      8pm   ___1.523 kwh        Thu 20-Mar-2014
3      6pm     __0.424  kwh          23-Apr-2014
4      1am   __0.209  kwh     Friday 19-Dec-2014
...     ...             ...                  ...
8755   1am       0.084 kwh       Fri 07-Nov-2014
8756   6am       _1.027 kwh          20-May-2014
8757   2am      __0.052 kwh   Tuesday 8-Apr-2014
8758   9pm     1.428  kwh            27-Jan-2014
8759  12pm     0.528  kwh            25-Aug-2014

[8760 rows x 3 columns]

**Getting date from string**

In [243]:
df[2] = df[2].str[-11:]
df

          0               1            2
0      3pm    __0.384 kwh    24-Mar-2014
1      5am    __1.201  kwh   15-Aug-2014
2      8pm   ___1.523 kwh    20-Mar-2014
3      6pm     __0.424  kwh  23-Apr-2014
4      1am   __0.209  kwh    19-Dec-2014
...     ...             ...          ...
8755   1am       0.084 kwh   07-Nov-2014
8756   6am       _1.027 kwh  20-May-2014
8757   2am      __0.052 kwh   8-Apr-2014
8758   9pm     1.428  kwh    27-Jan-2014
8759  12pm     0.528  kwh    25-Aug-2014

[8760 rows x 3 columns]

**Formatting power(kwh) column**

In [244]:
df[1] = df[1].str.replace("_","")
df[1] = df[1].str.replace(" kwh","")
df

          0         1            2
0      3pm    0.384    24-Mar-2014
1      5am    1.201    15-Aug-2014
2      8pm    1.523    20-Mar-2014
3      6pm     0.424   23-Apr-2014
4      1am   0.209     19-Dec-2014
...     ...       ...          ...
8755   1am     0.084   07-Nov-2014
8756   6am      1.027  20-May-2014
8757   2am      0.052   8-Apr-2014
8758   9pm   1.428     27-Jan-2014
8759  12pm   0.528     25-Aug-2014

[8760 rows x 3 columns]

**Reordering and renaming columns**

In [245]:
df = df[[0,2,1]]
df.rename(columns={0:"Time", 2:"Date", 1:"kwh"}, inplace=True)
df

       Time         Date       kwh
0      3pm   24-Mar-2014   0.384
1      5am   15-Aug-2014   1.201
2      8pm   20-Mar-2014   1.523
3      6pm   23-Apr-2014    0.424
4      1am   19-Dec-2014  0.209
...     ...          ...       ...
8755   1am   07-Nov-2014    0.084
8756   6am   20-May-2014     1.027
8757   2am    8-Apr-2014     0.052
8758   9pm   27-Jan-2014  1.428
8759  12pm   25-Aug-2014  0.528

[8760 rows x 3 columns]